Plantucha/SomnoTrace/sdkconfig.defaults
# SomnoTrace default project configuration.
# These defaults seed the generated (git-ignored) sdkconfig. Set the target
# with: ./scripts/idf.sh set-target esp32s3

# Target chip
CONFIG_IDF_TARGET="esp32s3"

# PSRAM: ESP32-S3R8 has 8 MB octal SPI RAM. The app runs Wi-Fi + BLE + SD/FATFS
# + HTTP + a 240x240 LCD framebuffer concurrently, which exhausts the ~290 KB
# internal RAM and makes the Wi-Fi SoftAP beacon / SDMMC DMA allocations fail.
# We do NOT route Wi-Fi/LWIP or SDMMC buffers to PSRAM — those need internal
# DMA-capable RAM. Instead we leave them internal and let only LARGE (>16 KB)
# allocations (the LCD framebuffer, HTTP/cJSON scratch) spill into PSRAM, which
# frees enough internal RAM for the DMA-critical buffers.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# Flash: 16 MB, recommended for OTA + EDF staging. Adjust to your module.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# Custom partition table (OTA + 16MB)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Use the native USB Serial/JTAG for console/logging (USB-C).
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Wi-Fi defaults
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32

# HTTP server: enough URI handlers and header space for the portal
# Mobile browsers send very long headers during captive-portal detection.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_HTTPD_STACK_SIZE=8192

# BLE: NimBLE host.  We are a central (GATT client) for AirSense 11, but
# ROLE_PERIPHERAL + GATT_SERVER must also be enabled so that NimBLE compiles
# in ble_att_svr_rx_notify -- the ATT dispatch entry that generates
# BLE_GAP_EVENT_NOTIFY_RX for incoming notifications.  Without it, the AS11's
# responses are silently dropped at the ATT layer.  We never advertise.
# See spec/0001-airsense11-ble-sync.md §4.4 and as11_ble.c file header.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_GATT_SERVER=y

# WiFi + BLE coexistence
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y
CONFIG_BT_NIMBLE_MSYS1_BLOCK_COUNT=24
CONFIG_BT_NIMBLE_MSYS1_BLOCK_SIZE=256
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
# CONFIG_BT_NIMBLE_SECURITY_ENABLE is not set
CONFIG_BT_NIMBLE_DEBUG=y
CONFIG_BT_NIMBLE_LOG_LEVEL_DEBUG=y
CONFIG_LOG_DEFAULT_LEVEL_DEBUG=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# SD card (SDMMC 4-bit mode on GPIO 13-18)
CONFIG_SDMMC_MAX_BLK_LEN=512

# FatFS via VFS
CONFIG_FATFS=y
CONFIG_FATFS_VOLUME_COUNT=2
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_CODEPAGE=850
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_FS_LOCK=0
CONFIG_FATFS_USE_LABEL=y
CONFIG_FATFS_SECTOR_512=y

# mbedTLS: disable hardware AES — the ESP32-S3 AES accelerator intermittently
# fails (MBEDTLS_ERR_PLATFORM_HW_ACCEL_FAILED) on larger payloads (>256 bytes)
# when BLE + Wi-Fi coexistence is active. Software AES is fast enough for our
# RPC encryption use case.
CONFIG_MBEDTLS_HARDWARE_AES=n
